Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །མཛའ་བ་དང་ནི་མཛའ་བ་མ་ལགས་དང་། །མཐུན་པ་དང་ནི་མཐུན་པ་མ་ལགས་དང་། །གཡོ་དང་མི་གཡོ་རང་བཞིན་གནས་པ་ལ།
en: Obedient ones and disobedient ones, Wavering ones and ones who are naturally unwavering,

source: །ངོ་མཚར་འཛིན་པ་ནམ་ཡང་མི་མངའོ།
en: You are never surprised. “Having observed the agitated beings,

source: །སྨྲེ་སྔགས་འདོན་ཅིང་སྙིང་བརྩེར་སྨྲ་བ་དང་། །ཁ་ཆུ་འཛགས་པས་ཉམ་ཐག་སྐད་འབྱིན་དང་། །ཡོངས་སུ་གདུངས་དང་རྣམ་པར་གདུངས་ལྡན་དང་། །འཇིགས་དང་རིམས་ནད་མྱ་ངན་གྱིས་ཉེན་པ།
en: Who lament, speak miserably, Slobber, and utter weary sounds;

source: །སྡུག་བསྔལ་རྣམ་པ་བརྒྱ་ཡིས་གཙེས་པ་དང་། །ཡུན་རིང་ནས་ནི་མགོན་མེད་བདེ་བ་མེད།
en: Who are tormented, pained, “Afflicted by fear and sorrow, And oppressed by hundreds of kinds of suffering; Who have lacked protection and happiness for a long time

source: །སྲིད་པའི་སྲེད་པར་ཞུགས་ཤིང་མུན་བསྒྲིབས་པའི། །འགྲོ་བ་འཁྲུགས་པ་ལ་ནི་རབ་གཟིགས་ནས།
en: And have fallen into desire for existence, and who are covered with darkness,

source: །བདག་ཉིད་རྣམ་པ་སྣ་ཚོགས་མཐུ་དག་གིས།
en: “With various kinds of your power,

source: །ཐུབ་པ་ཐུགས་རྗེ་ཆེན་པོ་འཇུག་མཛད་ཅིང་།
en: Having a muni’s great compassion as a muni,

source: །ཤཱཀྱ་སྐྱེས་ཀྱི་མཆོག་ནི་ཁྱོད་ཉིད་ཀྱིས།
en: O best of the Śākyans, you exert yourself

source: །ཕོངས་པར་གྱུར་རྣམས་དགྲོལ་ཕྱིར་བརྩོན་པར་མཛད།
en: To liberate those who are so distressed.

source: །སྲིད་པའི་སྡུག་བསྔལ་རྒྱུ་དང་བཅས་འདི་དང་། །སྲིད་པའི་སྡུག་བསྔལ་ཟད་པ་གང་ཡིན་དང་། །སྲིད་པའི་སྡུག་བསྔལ་འགོག་པར་འགྲོ་བ་ཡི། །ལམ་ནི་མཚུངས་པ་མེད་པ་ཁྱོད་ཀྱིས་བཤད།
en: “The suffering of existence along with its cause, The cessation of the suffering of existence, And this incomparable path, which leads to The cessation of the suffering of existence, are taught by you.

source: །རྣམ་པར་འདྲེན་པ་ཆེན་པོ་བརྩོན་འགྲུས་ཆེ།
en: “O great leader with great vigor,

source: །རབ་མཆོག་ཕ་རོལ་སྨྲ་བ་རྣམས་ཀྱི་མཆོག །འཇིག་རྟེན་གསུམ་ན་ཁྱོད་མཚུངས་མ་མཆིས་ན།
en: The best of the most excellent speakers, None is equal to you in the three realms;

source: །ཁྱོད་ལས་ལྷག་པ་ལྟ་ཞིག་ག་ལ་མཆིས།
en: None surpasses you anywhere.

source: །ཁྱོད་ལ་ཁོང་ཁྲོ་རྗེས་སུ་ཆགས་མི་མངའ།
en: “You have neither wrath nor sycophancy;

source: །ཐུབ་པ་ཁྱོད་ལ་ཡོངས་སུ་ཟག་མི་མངའ།
en: O Muni, you have no difficulty. O one who made an excellent vow, you have neither

source: །སྡུག་དང་འགལ་དང་རྩོད་པ་བརྟུལ་ཞུགས་བཟང་།
en: Compliance, opposition, nor dispute.

source: །ཁྱོད་ལ་མི་མངའ་རྟག་ཏུ་མི་མངའ་ལགས།
en: You never have any of these.

source: །ཐུབ་པ་སྡུག་དང་མི་སྡུག་བདེ་བ་དང་། །སྡུག་བསྔལ་མཉམ་དང་དེ་བཞིན་མི་མཉམ་སྤངས།
en: “O Muni, having left behind what is agreeable and what is disagreeable, Happiness and suffering, and what is even and what is uneven,

source: །དགའ་དང་མི་དགའ་བ་དག་བཟོད་མཛད་དེ།
en: You bear satisfaction and dissatisfaction,

source: །ཡང་དག་བསྡམས་ཤིང་འདི་ན་ཉེར་ཞི་སྤྱོད།
en: And, being well restrained, conduct yourself with tranquility.

source: །སྨད་པ་བྱས་ཀྱང་གནོད་པ་མི་མངའ་ལ།
en: “Since, experiencing neither slander nor harm,

source: །རབ་ཏུ་བསྔགས་པས་ཁེངས་པར་མི་འགྱུར་བས།
en: You do not become haughty by praise,

source: །གྲགས་པ་གྲགས་པ་མ་ཡིན་ཁྱོད་ལ་མཉམ།
en: Fame and infamy are the same to you.

source: །གླང་ཆེན་མཆེ་བར་ལྡན་པ་གཡུལ་ངོ་རུ།
en: “Just as a tusked elephant is released for battle

source: །འདོར་བ་དྲག་ཏུ་འཕངས་པའི་མདའ་དག་ལྟར།
en: And bears arrows fiercely shot,

source: །སྐྱེ་བོ་སྡིག་ཅན་རྣམས་ཀྱིས་སྨྲས་པ་ཡི། །ཚིག་ངན་ཚིག་རྩུབ་དག་ཀྱང་བཟོད་པར་མཛད།
en: You bear evil words—harsh words Spoken by evil people.

source: །དྲང་སྲོང་ཁྱོད་སྙན་གསུང་ཞིང་ཚིག་ཀྱང་བཟོད།
en: “O Ṛṣi who speaks gently, you are tolerant of words;

source: །ཤིན་ཏུ་ངན་དུ་སྨྲས་པའང་མི་བཟོད་མེད།
en: There is no word you do not bear, even if very ill-spoken.

source: །སྨད་པར་སྨྲས་སམ་དགེ་བར་སྨྲས་ཀྱང་རུང་།
en: Whether slanderously or virtuously spoken of,

source: །ཐུབ་པ་མཉམ་པ་ཉིད་དུ་གནས་པ་ལགས།
en: The Muni abides in sameness.

source: །མཆོད་འོས་རྟག་པར་མི་དང་ལྷ་དག་དང་། །ལྷ་མིན་གནོད་སྦྱིན་སྲིན་པོ་རྣམས་དང་ནི།
en: “The one worthy of worship is always worshiped by humans, gods, Asuras, yakṣas, rākṣasas,

source: །དྲང་སྲོང་བདག་ཉིད་ཆེན་པོས་རྟག་མཆོད་ན།
en: And great ṛṣis.

source: །ཁྱོད་ནི་ཐུགས་བརྟན་གཞན་དུ་འགྱུར་མི་མངའ།
en: Your mind is steady and does not become otherwise.

source: །འདི་བས་བདག་མཆོག་ཅེས་ཀྱང་རློམ་མི་མངའ།
en: “Since you do not feel conceit such as ‘I am superior to this one,’

source: །འདི་བས་བདག་ཆུང་ཞེས་ཀྱང་རློམ་མི་མངའ།
en: ‘I am inferior to this one,’

source: །བདག་ནི་འདི་དང་མཉམ་ཞེས་མི་རློམ་པས།
en: Or ‘I am equal to this one,’

source: །ཁྱོད་ལ་ང་རྒྱལ་རྣམ་པ་གསུམ་མི་མངའ།
en: You do not have the three kinds of pride.

source: །བརྟན་དང་ལྡན་ལ་བོང་བ་གསེར་དང་མཚུངས།
en: “Steady, looking upon a lump of dirt and gold equally,

source: །བཻ་ཌཱུརྱ་དང་གསེག་མ་གྱོ་མོར་མཚུངས།
en: Looking upon lapis lazuli and pebbles and gravel equally,

source: །ཐུབ་པ་ཆེན་པོ་ལྷ་དང་བཅས་པ་ཡི། །འགྲོ་བ་འདི་ནི་རྩྭ་ཤིང་འདྲ་བར་སྤྱོད།
en: O Great Muni, you behave as if these beings, Including gods, are the same as grass or trees.

source: །ཟླ་བ་ཉི་མའི་འོད་ཟེར་དང་ཕྲད་ནས།
en: “Even if the moonlight and the sunlight come together,

source: །གྲང་དང་ཚ་བའི་རླུང་དག་ལངས་ན་ཡང་།
en: And cold and hot winds arise,

source: །རི་ཡི་དབང་པོ་ལྟ་བུར་བཟོད་མཛད་དེ།
en: You bear it just like the lord of mountains;

source: །ཐུགས་བརྟན་ཁྱོད་ལ་རབ་ཏུ་གནོད་མི་མངའ།
en: With a steady mind, you receive no harm.

source: །གཟིམས་ཆ་དང་ནི་སྩང་ནས་བཤོས་དང་ནི།
en: “Having examined various kinds of bedding, drink, food, And upper and lower garments

source: །བླ་གོས་ཤམ་ཐབས་རྣམ་པ་སྣ་ཚོགས་དག །ཐུབ་པ་ཟག་མེད་སོ་སོར་བརྟགས་ནས་ནི།
en: As unpolluted, O Muni,

source: །དེ་ཡི་དོན་དུ་བསྟེན་པར་མཛད་པ་ལགས།
en: You enjoy them.

source: །མགོན་པོ་བདག་ལ་མེད་ཅེས་ཐུགས་ངན་མེད།
en: “You do not lament, ‘I have no protector’;

source: །མ་བཅིངས་ལེགས་གསུང་བདག་གིར་འཛིན་མི་མངའ།
en: Being unbound, speaking well, not seizing anything as your own,

source: །གནོད་པ་སྣ་ཚོགས་དག་ལས་ཡོངས་སུ་གྲོལ།
en: You are free from various injuries.

source: །རྙེད་པ་བརྙེས་ནའང་དགྱེས་པར་མི་འགྱུར་ལ།
en: “Obtaining profit, you are not delighted;

source: །དེ་མ་བརྙེས་པས་ཀྱང་ནི་ཞུམ་མི་འགྱུར།
en: Not obtaining it, you are not discouraged.

source: །ཁྱད་དུ་གསོད་པ་བཟོད་པ་མཛད་ཅིང་འདིར།
en: Enduring disrespect, here

source: །བཀུར་སྟི་དག་ལའང་ཆགས་པ་མི་མངའ་ལགས།
en: You are not attached to respect. “The excellent blood-red sandalwood

source: །ལྷ་གནས་རི་ཡི་ངོས་ལས་འཁྲུངས་པ་ཡི།
en: That grows on the side of the mountain where gods dwell,

source: །ཁྲག་ལྟར་དམར་བའི་ཙན་དན་མཆོག་དག་དང་། །མདའ་དང་རལ་གྲི་རྣོན་པོས་ཁྱོད་ཀྱི་ཐུགས།
en: And sharp arrows and swords,

source: །ལན་འགའ་ཡང་ནི་འགྱུར་བ་མི་མངའ་ལགས།
en: Never change your mind.

source: །དོན་མེད་གཏམ་ནི་གསུང་བར་མི་མཛད་གང་།
en: “You engage neither in meaningless talk

source: །སྐྱེ་བོ་ངན་པས་བསྟེན་པའི་གཏམ་མ་ལགས།
en: Nor in talk employed by wicked people—

source: །རྙེད་པའི་གཏམ་མིན་ཟང་ཟིང་བཅས་གཏམ་མིན།
en: Neither talk of profit, worldly talk,

source: །བདག་ཉིད་ཆེ་རྣམས་མི་འདོད་མ་ལགས་ཀྱི།
en: Nor talk undesirable for great people—

source: །གཏམ་གང་རབ་དབེན་བདེ་བ་སྐྱེད་བྱེད་ཅིང་།
en: “But you utter the words that generate seclusion and happiness,

source: །རབ་ཏུ་ཞི་བ་འབའ་ཞིག་རབ་བརྗོད་པ།
en: The talk in which you proclaim only tranquility,

source: །ལྷ་ལས་འདས་པའི་གཏམ་ནི་གང་དག་ཅིག །གསུངས་ནས་སྡིག་པ་རྣམ་པར་འདུལ་བ་གསུངས།
en: The talk that surpasses the gods’, And the talk through which you remove sin. “O Great Muni, for the sake of the world,

source: །སྙན་པ་རྣམས་དང་འབྲེལ་པ་རྣམས་དང་ནི།
en: You speak words that are

source: །ལེགས་པར་བཤད་དང་སྙིང་པོར་ལྡན་པ་ཡི། །རྣམ་པར་ངེས་པའི་གཏམ་དག་ཐུབ་པ་ཆེ།
en: Sweet, reasoned, eloquent,

source: །འགྲོ་བའི་དོན་སླད་རབ་ཏུ་གསུང་བར་མཛད།
en: Substantial, and definitive.

source: །མི་མཁས་དག་དང་ལོག་པར་ལྟ་རྣམས་དང་། །གཟུ་ལུམས་ཅན་དང་དགའ་བར་ལྡན་རྣམས་དང་། །ཕྲ་མ་ཅན་དང་ཚིག་རྩུབ་སྒྱུ་ཅན་གང་།
en: “Those who are foolish, who have wrong views, Who are liars, who are connected to pleasure, Who speak slanderous, harsh, or deceitful words—

source: །དེ་དང་ལྷན་ཅིག་བཅོམ་ལྡན་ཁྱོད་མི་རྐྱེན།
en: O Blessed One, you never associate with them.

source: །མི་ནི་གང་དག་དྲང་ཞིང་སྒྱུ་མེད་ལ།
en: “Those who are straightforward, who do not deceive,

source: །བདེན་ལ་དགའ་ཞིང་དབང་པོ་ཐུལ་བ་དང་། །རྟག་ཏུ་ལེགས་པར་བརྟགས་ནས་བྱེད་པ་ནི།
en: Who are pleased with truth, who have trained their faculties, Who always act after full consideration—

source: །ཆོས་མཁྱེན་ལུགས་མཁྱེན་གང་ཟག་མཁྱེན་པ་དང་། །དྲུག་པོ་མངོན་མཁྱེན་ཁྱོད་ལ་རྟག་ཕྱག་འཚལ།
en: “O one who knows the Dharma, means, and individuals, O one who possesses the six kinds of supernormal knowledge, I always bow to you.

source: །ཐུབ་པ་ཞིང་མཁྱེན་མཆོག་དང་མཆོག་མིན་མཁྱེན།
en: O Muni, skillful one, one who knows the greater and lesser capacities of beings

source: །ཚུལ་དང་ཚུལ་མིན་མཁྱེན་ཁྱོད་མགོས་ཕྱག་འཚལ།
en: And good and bad conduct, I bow my head to you.

source: །ཁྱོད་ཀྱི་ཡོན་ཏན་རྒྱ་མཚོ་རྒྱ་ཆེན་ལེགས་མཐོང་ནས།
en: “Having observed the immense ocean of your good qualities,

source: །བདག་གིས་ཡོན་ཏན་ཕྱོགས་གཅིག་ཡོངས་སུ་བརྗོད་པར་བས།
en: I have described merely a fraction of your good qualities;

source: །འཕགས་པ་ཁྱོད་ཀྱི་ཡོན་ཏན་རྒྱ་མཚོའི་ཕ་རོལ་ནི།
en: O noble one, the far shore of the ocean of your good qualities

source: །རྟོགས་པར་རྔོ་ཐོག་འགྲོ་བའི་ནང་ན་མི་མ་མཆིས།
en: Cannot be known by anyone in the world.”

source: །དེ་ལྟ་བུ་ལ་སོགས་པ་བསྟོད་པ་ལྔ་བརྒྱས་བཅོམ་ལྡན་འདས་ལ་བསྟོད་ནས་དེ་ལྟར་མངོན་པར་དད་པར་གྱུར་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་སྔོར་གྱུར་ཇི་ལྟར་སྟན་དེ་ཉིད་ལ་འདུག་བཞིན་དུ་བདེན་པ་མཐོང་བར་འགྱུར་བའི་ཆོས་བཤད་པ་མཛད་དོ།
en: When Nīlabhūti had praised the Blessed One with five hundred verses of praise, including those just recounted, and thus was filled with faith, the Blessed One preached the Dharma for him, so that he saw the truths, sitting on that very seat.

source: །དེ་ནས་བྲམ་ཟེ་སྔོར་གྱུར་གྱིས་བཅོམ་ལྡན་འདས་ལ་བསྟོད་ནས་སོང་སྟེ་དེ་ལམ་དུ་ཞུགས་པ་ན།
en: After that, the brahmin Nīlabhūti, having praised the Blessed One, departed.

source: བཅོམ་བརླག་གི་བྲམ་ཟེ་རྣམས་ཀྱིས་ཚིག་གི་རྒྱ་ལྕག་གིས་པགས་པ་ལས་ཐལ་བ་ཙམ་དུ་བརྒྱད་དེ།
en: When he was walking along the road, the brahmins in Mathurā scolded him:

source: མཁན་པོ་ཁྱོད་ལ་ཁོ་བོ་ཅག་གིས་དགེ་སྦྱོང་གཽ་ཏ་མ་ལ་བཀུར་སྟི་མ་ཡིན་པ་བྱོས་ཤིག་ཅེས་སྨྲས་ན།
en: “Sir, we asked you to perform disrespectful acts toward the śramaṇa Gautama.

source: ཁྱོད་ད་གཟོད་སླར་བསྟོད་དེ་འོང་ངམ།
en: Are you now coming back, having praised him?”

source: ཤེས་ལྡན་དག་ཁོ་བོས་སྔར་ཁོ་བོའི་ལྕེ་ནི་བདེན་པའི་རྗེས་སུ་འབྲང་བ་ཡིན་ཏེ།
en: “Sirs, did I not say before, ‘My tongue follows the truth.

source: གལ་ཏེ་སྨད་པར་འོས་པ་ཞིག་ན་སྨོད་ལ།
en: If he deserves to be reviled, I will revile him.

source: བསྟོད་པར་འོས་པ་ཞིག་ན་བསྟོད་དོ་ཞེས་སྔར་མ་སྨྲས་སམ།
en: But if he deserves praise, I will praise him’?

source: དགེ་སྦྱོང་གཽ་ཏ་མ་ནི་བསྟོད་པར་འོས་པས་ཁོ་བོས་བསྟོད་དོ།
en: Since the śramaṇa Gautama deserves praise, I praised him.” D.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་སྔ་དྲོ་ན་བཟའ་ཤམ་ཐབས་མནབས་ལྷུང་བཟེད་དང་ཆོས་གོས་བསྣམས་ནས་བཅོམ་བརླག་ཏུ་བསོད་སྙོམས་ལ་ཞུགས་པ་དང་། དེའི་ཚེ་བཅོམ་བརླག་ན་རྒྱུ་སྐར་གྱི་ནུབ་མོ་ལ་བབ་བོ།
en: The Obstruction of the Buddha’s Way by a Goddess The Blessed One dressed early one morning, took his bowl and his robe, and entered Mathurā for alms. At that time, it was the day of the star festival in Mathurā.

source: །དེ་ནས་བཅོམ་བརླག་ན་གནས་པའི་ལྷ་མོ་གང་ཡིན་པ་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། གལ་ཏེ་དགེ་སྦྱོང་གཽ་ཏ་མ་བཅོམ་བརླག་ཏུ་འོངས་ན་བདག་གི་རྒྱུ་སྐར་གྱི་ནུབ་མོ་ལ་བར་ཆད་བྱེད་པར་འགྱུར་རོ་སྙམ་དུ་བསམས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་སྒྲེན་མོར་བྱེད་ནས་འདུག་གོ།
en: A goddess living in Mathurā thought, “If the śramaṇa Gautama comes to Mathurā, he will interrupt my star festival.” She then stood naked before the Blessed One.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལྷ་མོ་རེ་ཞིག་བུད་མེད་ནི་ཤིན་ཏུ་བཀབ་ཀྱང་བཟང་བ་མ་ཡིན་ན་སྒྲེན་མོ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: The Blessed One said, “O goddess, a woman does not look beautiful even if she is covered with clothes, let alone naked.”

source: དེ་ནས་ལྷ་མོ་དེ་སྐྱེངས་ནས་ཕྱོགས་གཅིག་ཏུ་སོང་ངོ་།
en: Then the goddess was ashamed, and she left to one side of the road.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལམ་ལས་བཟུར་ཏེ་དགེ་སློང་གི་དགེ་འདུན་གྱི་གུང་ལ་གདན་བཤམས་པ་ཉིད་ལ་བཞུགས་སོ།
en: After that, the Blessed One himself left the road and sat on the seat prepared for him in front of the community of monks.

source: །བཞུགས་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ། དགེ་སློང་དག་བཅོམ་བརླག་ན་ནི་ཉེས་དམིགས་ལྔ་པོ་འདི་དག་ཡོད་དེ།
en: Having sat down, the Blessed One said to the monks, “Monks, there are five disadvantages of Mathurā: the land is uneven;

source: ལྔ་གང་ཞེ་ན་མཐོན་དམན་དང་སྡོང་དུམ་དང་ཚེར་མས་གང་བ་དང་། རྡོ་བ་དང་གསེག་མ་དང་གྱོ་མོ་མང་བ་དང་། དགོངས་ཀ་ཟ་བ་དང་བུད་མེད་མང་བ་ཡིན་ནོ།
en: it is full of logs and thorns; there are many stones, pebbles, and gravel there; people eat in the evening; and there are many women there.” E.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་མ་གཤེགས་པར་བཅོམ་བརླག་གི་གནོད་སྦྱིན་བོང་བུའི་གནས་གང་ན་བ་དེ་ལོགས་སུ་གཤེགས་ཏེ་བྱོན་ནས།
en: The Yakṣa Gardabha Thereupon the Blessed One, not going farther down the road, went to the residence of the yakṣa Gardabha near Mathurā.

source: གནོད་སྦྱིན་བོང་བུའི་གནས་བྱུལ་ཏེ་ཤིང་དྲུང་ཞིག་ཏུ་རྟེན་ཅིང་ཉིན་མོའི་གནས་པའི་ཕྱིར་བཞུགས་སོ།
en: When he arrived, he entered the residence of the yakṣa Gardabha and sat under a tree to pass the day there.

source: །དེའི་ཚེ་གནོད་སྦྱིན་བོང་བུ་བོང་བུའི་གཟུགས་སུ་བྱས་ནས་འཕྱན་པ་དང་དེ་ལ་ཁྱེའུ་དང་བུ་མོ་དག་ཞོན་པ་དང་། དེས་དེ་དག་རྩེར་བཅུག །དགའ་བར་བྱེད་དུ་བཅུག་ནས་ནགས་ཐིབས་པོར་སོང་ནས་ཟ་བར་བྱེད་པས།
en: At that time the yakṣa Gardabha used to walk around in the form of an ass (gardabha). When boys or girls wanted to ride on him, he would let them ride on his back, pleasing them in that way, and then go to a dense forest and eat them.

source: དེའི་མིང་གནོད་སྦྱིན་བོང་བུ་གནོད་སྦྱིན་བོང་བུ་ཞེས་བྱ་བར་གྲགས་སོ།
en: Therefore he was named “the yakṣa Gardabha.”

source: །བཅོམ་བརླག་གི་བྲམ་ཟེ་དང་ཁྱིམ་བདག་དད་པ་ཅན་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་བསོད་སྙོམས་ལ་གཤེགས་པ་ལས་ལྷ་མོ་ཞིག་གིས་ཐོ་བཙམས་པས། བཅོམ་བརླག་ཏུ་མ་གཤེགས་པར་གནོད་སྦྱིན་བོང་བུའི་གནས་སུ་གཤེགས་སོ་ཞེས་ཐོས་སོ། །ཐོས་ནས་ཀྱང་གཙང་ཞིང་བསོད་པའི་བཟའ་བ་དང་བཅའ་བ་དག་སོ་སོ་ནས་སྣོད་དུ་བཙོས་ཤིང་བསྡོགས་ཏེ་ཤིང་རྟར་བཅུག་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་དོང་སྟེ་ལྷགས་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: When the devout brahmins and householders in Mathurā heard that the Blessed One had come for alms, but, waylaid by a goddess, had not entered Mathurā but had gone to the residence of the yakṣa Gardabha, they cooked and prepared a pure and fine meal in pots, loaded the food on a carriage, and went to the Blessed One. Upon their arrival, they bowed low until their foreheads touched the Blessed One’s feet, and then they sat down to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བཅོམ་བརླག་གི་བྲམ་ཟེ་དང་ཁྱིམ་བདག་དད་པ་ཅན་རྣམས་ལ་ཆོས་དང་ལྡན་པའི་གཏམ་གྱིས་ཞེས་བྱ་བ་ནས།
en: When they had sat down to one side, the Blessed One, through talk consistent with the Dharma, instructed . . . the devout brahmins and householders in Mathurā.

source: །དེ་ནས་བྲམ་ཟེ་དང་ཁྱིམ་བདག་དད་པ་ཅན་རྣམས་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བདག་ཅག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་སླད་དུ་འདིར་གཙང་ཞིང་བསོད་པའི་བཟའ་བ་དང་བཅའ་བ་དག་གིས་ཤིང་རྟ་བཀང་སྟེ་འཚལ་ཏེ་མཆིས་ན།
en: Then the devout brahmins and householders in Mathurā rose from their seats, draped their upper robes over one shoulder, made the gesture of supplication to the Blessed One, and said to him, “O Honored One, we have brought here a carriage full of pure and fine food for the Blessed One.

source: བཅོམ་ལྡན་འདས་ཐུགས་བརྩེ་བ་ཉེ་བར་བཟུང་སྟེ་དེ་བཞེས་སུ་གསོལ།
en: May the Blessed One have compassion for us and accept this food.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་སོང་ལ་གནོད་སྦྱིན་བོང་བུའི་གནས་ན་དགེ་སློང་ཇི་སྙེད་ཉེ་བར་རྟེན་ཅིང་གནས་པ་དེ་དག་ཐམས་ཅད་རིམ་གྲོའི་གནས་སུ་སྡུས་ཤིག །
en: The Blessed One said to the venerable Ānanda, “Ānanda, go and gather all the monks living near the residence of the yakṣa Gardabha in the assembly room.

source: བསོད་སྙོམས་ཡོངས་སུ་ལོངས་སྤྱོད་དུ་གཞུག་གོ།
en: I will let them have the almsfood.”

source: གནོད་སྦྱིན་བོང་བུའི་གནས་ན། དགེ་སློང་ཇི་སྙེད་ཉེ་བར་རྟེན་ཅིང་གནས་པ་དེ་དག་ཐམས་ཅད།
en: Having gathered all the monks living near the residence of the yakṣa Gardabha in the assembly room, he went to the Blessed One.

source: རིམ་གྲོའི་གནས་སུ་བསོགས་ནས། བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་སོང་སྟེ་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: When he arrived, he bowed low until his forehead touched the Blessed One’s feet, and then he sat down to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་གནོད་སྦྱིན་བོང་བུའི་གནས་ན་དགེ་སློང་ཇི་སྙེད་ཉེ་བར་རྟེན་ཅིང་མཆིས་པ་དེ་དག་ཐམས་ཅད་རིམ་གྲོའི་གནས་སུ་བསོགས་ལགས་ཏེ།
en: Having sat down to one side, the venerable Ānanda said to the Blessed One, “O Honored One, all the monks living near the residence of the yakṣa Gardabha are gathered in the assembly room.

source: དེ་ནས་བཅོམ་ལྡན་འདས་རིམ་གྲོའི་གནས་ག་ལ་བ་དེར་གཤེགས་ཏེ་བྱོན་ནས། དགེ་སློང་གི་དགེ་འདུན་གྱི་གུང་ལ་གདན་བཤམས་པ་ཉིད་ལ་བཞུགས་སོ།
en: Thereupon the Blessed One went to the assembly room and sat on the seat prepared for him in front of the community of monks.

source: །དེ་ནས་བཅོམ་བརླག་གི་བྲམ་ཟེ་དང་ཁྱིམ་བདག་དད་པ་ཅན་རྣམས་ཀྱིས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་བདེ་བར་བཞུགས་པར་རིག་ནས་ཞེས་བྱ་བ་ནས། ཕྱག་གཉིས་བཅབས་ཏེ་ལྷུང་བཟེད་གྱུ་བར་རིག་ནས་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ། །བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་གསོལ་བ་གདབ་པའི་ཕྱིར་འཁོད་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: The devout brahmins and householders in Mathurā then knew that the community of monks headed by the Buddha had sat down in comfort, . . . knowing the Blessed One had . . . washed his hands and his bowl, they sat before the Blessed One in order to ask a favor.

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུ་གདུག་པ་དང་། གནོད་སྦྱིན་གདུག་པ་དེ་དང་དེ་རྣམས་ནི་བཏུལ་ལགས་ན།
en: They said, “O Honored One, the Blessed One has converted the wicked nāgas So-and-so and the wicked yakṣas So-and-so.

source: བཙུན་པ་གནོད་སྦྱིན་བོང་བུ་འདི་བདག་ཅག་ལ་ཡུན་རིང་པོ་ཞིག་ནས་ཤ་ཁོན་མ་མཆིས་པར་ནི་ཤ་ཁོན་བགྱིད། འགྲན་ཟླ་མ་ལགས་པར་ནི་འགྲན་ཟླ་བགྱིད། གླགས་མ་བཙལ་བར་ནི་གླགས་ཚོལ་བར་བགྱིད་དེ། བུས་པ་བཙས་ཤིང་བཙས་པ་རྣམས་འཕྲོག་པར་བགྱིད་ལགས་ན། ཀྱེ་མའོ་བཅོམ་ལྡན་འདས་ཐུགས་བརྩེ་བ་ཉེ་བར་བཟུང་སྟེ་གནོད་སྦྱིན་བོང་བུ་གདུལ་བར་གསོལ།
en: O Honored One, this yakṣa Gardabha has for a long time been hostile toward us who are not hostile, adversarial toward us who are not adversarial, and injurious to us who have not been injurious, and he snatches our children away whenever one is born. May the Blessed One have compassion and convert the yakṣa Gardabha.”

source: དེའི་ཚེ་གནོད་སྦྱིན་བོང་བུ་འཁོར་དེ་ཉིད་དུ་འདུས་ཤིང་འདུག་པར་གྱུར་ཏོ།
en: At that time the yakṣa Gardabha himself was sitting in the assembly.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གནོད་སྦྱིན་བོང་བུ་ལ་བཀའ་སྩལ་པ། བོང་བུ་ཁྱོད་ཀྱིས་ཐོས་སམ།
en: The Blessed One asked the yakṣa Gardabha, “Gardabha, did you hear this?”

source: །བོང་བུ་ཁྱོད་ཀྱིས་ཐོས་སམ།
en: “Gardabha, did you hear this?”

source: །དམ་པ་མ་ཡིན་པའི་ཆོས་སྡིག་པ་ལས་ལོག་ཤིག །བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གི་སླད་དུ་ཕྱོགས་བཞིའི་དགེ་སློང་གི་དགེ་འདུན་གྱི་གཙུག་ལག་ཁང་རྩིག་པར་དམ་འཆའ་བར་བགྱིད་ན་བདག་ལྡོག་གོ།
en: “Quit that inferior, evil conduct.” “O Honored One, if they promise to have a monastery for the community of monks of the four directions built for my sake, I will stop.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཅོམ་བརླག་གི་བྲམ་ཟེ་དང་ཁྱིམ་བདག་དད་པ་ཅན་རྣམས་ལ་བཀའ་སྩལ་པ། བྲམ་ཟེ་དང་ཁྱིམ་བདག་ཁྱེད་ཅག་གིས་ཐོས་སམ། བཅོམ་ལྡན་འདས་ཐོས་ལགས་ཏེ་བརྩིག་གོ།
en: Then the Blessed One asked the devout brahmins and householders in Mathurā, “Brahmins and householders, did you hear this?” “O Blessed One, we did.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གནོད་སྦྱིན་བོང་བུ་འཁོར་ལྔ་བརྒྱ་དང་བཏུལ་ཏོ།
en: We will build it.” Then the Blessed One converted the yakṣa Gardabha, along with his five hundred attendants.

source: །བྲམ་ཟེ་དང་ཁྱིམ་བདག་དད་པ་ཅན་རྣམས་ཀྱིས་དེའི་ཆེད་དུ་གཙུག་ལག་ཁང་ལྔ་བརྒྱ་བརྩིགས་སོ།
en: The devout brahmins and householders built five hundred monasteries for his sake.

source: །དེ་བཞིན་དུ་གནོད་སྦྱིན་མདའ་ཅན་དང་གནོད་སྦྱིན་ནགས་ལྡན་དང་གནོད་སྦྱིན་མོ་བསླང་རྙེད་མ་དང་མཆུ་རྣམས་བཏུལ་ཏོ།
en: In the same way, the Blessed One converted the yakṣa Śara, the yakṣa Vana, and the yakṣiṇī Ālikāvendāmaghā.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་རྫུ་འཕྲུལ་གྱིས་བཅོམ་བརླག་ཏུ་ཞུགས་སོ།
en: Thereupon the Blessed One entered Mathurā using his magical power.

source: །ཞུགས་ནས་གནོད་སྦྱིན་མོ་འགྲན་ཟླ་མ་འཁོར་ལྔ་བརྒྱ་དང་བཏུལ་ནས་དེའི་དོན་དུ་གཙུག་ལག་ཁང་ལྔ་བརྒྱ་བརྩིགས་སོ།
en: Once there, he converted the yakṣiṇī Timisikā, along with her five hundred attendants, and five hundred monasteries were built for her sake.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཅོམ་བརླག་གི་ནང་དང་ཕྱི་རོལ་དུ་གནོད་སྦྱིན་ཉིས་སྟོང་ལྔ་བརྒྱ་བཏུལ་ནས་དེའི་ཆེད་དུ་བྲམ་ཟེ་དང་ཁྱིམ་བདག་དད་པ་ཅན་རྣམས་ཀྱིས་གཙུག་ལག་ཁང་ཉིས་སྟོང་ལྔ་བརྒྱ་བརྩིགས་སོ།
en: After that, the Blessed One converted twenty-five hundred yakṣas inside and outside Mathurā, and the devout brahmins and householders built twenty-five hundred monasteries for their sake. IV. Otalā Park A. The Visit of the Brahmin Otalāyana

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཨོ་ཏ་ལར་གཤེགས་ཏེ། ཨོ་ཏ་ལར་ཨོ་ཏ་ལའི་ནགས་ཁྲོད་ན་བཞུགས་སོ།
en: Thereupon the Blessed One went to Otalā and stayed in Otalā Forest near Otalā.

source: །དེ་ན་བྲམ་ཟེ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་ཨོ་ཏ་ལའི་བུ་ཞེས་བྱ་བ་ཕྱུག་པ་ནོར་མང་བ་ལོངས་སྤྱོད་ཆེ་བ་ཞིག་གནས་སོ་ཞེས་བྱ་བ་རྒྱས་པར་སྦྱར་རོ།
en: There lived a very wealthy brahmin named Otalāyana, who was rich and had great wealth and many possessions . . . .

source: །དེ་ནས་བཅོམ་ལྡན་འདས་སྔ་དྲོ་ན་བཟའ་ཤམ་ཐབས་མནབས་ལྷུང་བཟེད་དང་ཆོས་གོས་བསྣམས་ཏེ་ཨོ་ཏ་ལར་བསོད་སྙོམས་ལ་ཞུགས་པ་དང་། ཕྱོགས་གཞན་ཞིག་ན་ཞིང་པ་ལྔ་བརྒྱ་ཙམ་མགོ་བོ་རྡུལ་གྱིས་ཡོག་ཅིང་ཤ་ནའི་རས་ཀྱིས་སྨད་གཡོགས་བགོས་ནས་ཞིང་རྨེད་པ་ལས་ཞིང་པ་དེ་རྣམས་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྐུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་བཅུ་རྩ་གཉིས་ཀྱིས་ཀུན་ནས་བརྒྱན་པ།
en: The Blessed One dressed early in the morning, took his bowl and his robe, and entered Otalā for alms. In a certain place, five hundred peasants were plowing a field in their hempen lower garments, their heads covered with dust.

source: གཟི་བརྗིད་ཀྱིས་མཛེས་པར་མཐོང་ངོ་ཞེས་བྱ་བ་རྒྱས་པར་སྦྱར་ཏེ།
en: The peasants saw the Blessed One, who was fully ornamented with the thirty-two marks of a great man, . . . and beautiful . . . with light . . . .

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་རྣམས་ལ་ཆོས་བཤད་པས་ཞེས་བྱ་བ་ནས་མཆོད་པར་བྱ་བ་དང་རྗེད་པར་བྱ་བ་དང་། མངོན་དུ་སྨྲ་བར་བྱ་བར་གྱུར་ཏོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: The Blessed One preached the Dharma for them . . . and they became objects of veneration, respect, and praise.

source: །དེ་ནས་རྨོན་པ་སྟོང་པོ་དེ་དག་གཉའ་ཤིང་དང་རུ་ཐག་བཅད་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་དོང་སྟེ་ལྷགས་ནས་བཅོམ་ལྡན་འདས་ཡོངས་སུ་བསྐོར་ཏེ་འདུག་གོ།
en: Then the thousand oxen broke their yokes and the ropes around their horns and went themselves to the Blessed One. When they arrived, they sat down, surrounding the Blessed One.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་རྣམས་ལ་ཚིག་གསུམ་གྱི་ཆོས་བཤད་པ་དང་། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་སུ་སྐྱེས་ནས་ཞེས་བྱ་བ་ནས་བདེན་པ་མཐོང་ནས་རང་གི་གནས་སུ་དོང་ངོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: When the Blessed One had preached the Dharma that consists of three phrases for them, they were reborn among the gods attendant on the Four Great Kings. . . . Having seen the truths, they left for their own residences.

source: །དགེ་སློང་རྣམས་ཐེ་ཚོམ་སྐྱེས་ནས་ཐེ་ཚོམ་ཐམས་ཅད་གཅོད་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཙུན་པ་ཞིང་པ་ལྔ་བརྒྱ་པོ་འདི་རྣམས་ཀྱིས་ལས་ཅི་ཞིག་བགྱིས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས་ཞིང་པ་རྣམས་སུ་གྱུར་ནས་དབུལ་པོའི་ཁྱིམ་རྣམས་སུ་སྐྱེས་ཤིང་འདི་རྣམས་ནི་རྨོན་པར་གྱུར་ལགས།
en: The monks, feeling doubtful, inquired of the Buddha, the Blessed One, the one who severs all doubts, “O Honored One, what karma did these five hundred peasants and these oxen create that matured to cause them to be born as peasants in poor families and to become oxen?”

source: དགེ་སློང་དག་འདི་རྣམས་ཀྱིས་ལས་བྱས་ཤིང་བསགས་པ་ཞེས་བྱ་བ་རྒྱས་པར་སྦྱར་ཏེ།
en: “Monks, the actions were performed and accumulated by them . . . .
